[{"Title": "Grand Rapids Triathlon", "Desc": "Olympic distance collegiate race in Grand Rapids, MI", "Loc": " ", "Time": "2019-06-09 8:00", "Cost": " ", "Type": "Other", "Tags": []}, {"Title": "UMMA Pop Up: Emma Aboukasm & Alex Anest", "Desc": "Emma Lee Aboukasm is an award-winning, Detroit-based recording artist, vocalist, pianist, and composer. Educated in classical and jazz music at the University of Michigan, she is now performing in a variety of venues, ranging from intimate venues like the Dirty Dog Jazz Cafe to the Detroit Jazz Festival. Emma Lee is on the vanguard of contemporary music in the heart of metro-Detroit.", "Loc": " ", "Time": "2019-06-09 13:00", "Cost": " ", "Type": "Performance", "Tags": ["Applications", "Art", "Detroit", "Family", "Festival", "International", "Museum", "Music", "Science", "Umma"]}, {"Title": "Abstraction, Color, and Politics in the Early 1970s", "Desc": "Abstraction, Color, and Politics in the Early 1970s explores large-scale works of art by Helen Frankenthaler, Louise Nevelson, Sam Gilliam, and Al Loving, within the context of highly-charged debates of the early 1970s about aesthetics, politics, race, and feminism. This exhibition explores the gendered and racialized terms upon which great art was defined and assessed, and the strategy of artists to question the identity and aesthetics of the artist making the art. UMMA docents will help visitors look through the lens of the four artists’ works to explore the aesthetic choices inherent in abstraction as well as the acts of staining, pouring, draping, —or even taking apart the wall itself—within this charged political context.", "Loc": " ", "Time": "2019-06-09 14:00", "Cost": " ", "Type": "Presentation", "Tags": ["Art", "Exhibition", "Museum", "Politics", "Umma"]}, {"Title": "Abstraction, Color, and Politics: The 1960s and 1970s", "Desc": "In the midst of the political and cultural upheavals of the 60s and 70s, artists, critics, and the public grappled with the relationship between art, politics, race, and feminism. During these decades, the notion that abstraction was a purely formal and American art form, concerned only with timeless themes disconnected from the present, was met with increased skepticism. Women artists and artists of color began to actively and assertively explore abstraction’s possibilities. The artworks in Abstraction, Color, and Politics: The 1960s and 1970s demonstrate both radical and disarming changes in how artists worked and what they thought their art was about. Their new formal and intellectual strategies—seen here across large-scale and miniature work—dramatically transformed the practice of abstraction in the 1960s and 1970s in a politically shifting American landscape.", "Loc": " ", "Time": "2019-06-09 14:00", "Cost": " ", "Type": "Presentation", "Tags": ["Art", "Museum", "Politics", "Umma"]}, {"Title": "In Conversation with Jason DeMarte: Photography in the Garden of Artificial Delights", "Desc": "The exhibition Jason DeMarte: Garden of Artificial Delights  invites viewers to journey into a visually stunning, though deeply unsettling, world in which flowers, birds, and insects are doused in glossy cake icing while candy rains down from ominous skies. In this immersive installation of photographs and wallpaper, Michigan-based photographer Jason DeMarte assembles hyperreal images of local wildlife and plantlife deluged by sugary foodstuffs. Join the artist and UMMA Assistant Curator of Photography Jennifer Friess for a conversation about the layers of meaning in these enticing yet enigmatic works.", "Loc": " ", "Time": "2019-06-09 15:00", "Cost": " ", "Type": "Lecture / Discussion", "Tags": ["Art", "Exhibition", "Museum", "Umma"]}, {"Title": "Tom Russell", "Desc": "Presented by The Ark", "Loc": " ", "Time": "2019-06-09 19:30", "Cost": "General Admission: $25. Reserved: $32. Service fees apply.", "Type": "Performance", "Tags": ["The ark"]}, {"Title": "Research Scholars Applications Open", "Desc": "Want to return to research for the Fall 2019-Winter 2020 Academic Year? Apply to the Research Scholars Program by August 1st at 5pm.", "Loc": "Undergraduate Science Building - 1190", "Time": "2019-06-01 1:00", "Cost": " ", "Type": "Other", "Tags": ["Applications", "Interdisciplinary", "Research", "Undergraduate", "Undergraduate students", "Urop"]}, {"Title": "Gilda Snowden Exhibition", "Desc": "Detroiter Gilda Snowden (1954 – 2014) works are predominately abstract, however, she was inspired by the things around her---particularly, the city of Detroit. The Flora Urbana series include abstracted floral forms, in encaustic, reflecting the community gardens growing where buildings once stood.", "Loc": "North Campus Research Complex Building 18 - Connection Gallery", "Time": "2019-05-10 5:00", "Cost": " ", "Type": "Exhibition", "Tags": ["African american", "Art", "Culture", "Detroit", "Exhibition", "Humanities"]}, {"Title": "Lester Johnson Exhibition", "Desc": "Lester Johnson is a multi-media artist who has experimented and pushed the boundaries of contemporary art.", "Loc": "North Campus Research Complex Building 18 - Rotunda Gallery", "Time": "2019-05-10 5:00", "Cost": " ", "Type": "Exhibition", "Tags": ["African american", "Art", "Culture", "Detroit", "Exhibition", "Humanities", "Visual arts"]}, {"Title": "True to Life: Film Director Nancy Savoca’s Quest for Authenticity", "Desc": "Filmmaker Nancy Savoca aims to be as authentic as possible. Her films are brilliant, intimate portraits that explore the weight of social institutions and social injustice placed upon the shoulders of her characters. Her lead characters, typically women, must balance their needs with those of others in order to find their true voice. This U-M student-curated exhibit is the result of a semester-long course devoted to her films and career.", "Loc": "Hatcher Graduate Library - Gallery (Room 100)", "Time": "2019-05-09 8:00", "Cost": " ", "Type": "Exhibition", "Tags": ["Exhibition", "Film", "Free", "Library"]}, {"Title": "Bonsai in Bloom: Satsuki Azalea", "Desc": "A display of satsuki azalea bonsai in bloom as well as a display of viewing stones (found stones or rocks that that resemble objects or landscapes). Includes events and workshops June 8 & 9 along with self-guided tours and other activities. The satsuki azalea are on loan from Ohio collector and U-M alumnus Dr. Melvyn Goldstein. To learn more and to view photos of the bonsai and viewing stones, visit:", "Loc": "Matthaei Botanical Gardens", "Time": "2019-06-08 10:00", "Cost": " ", "Type": "Exhibition", "Tags": ["Bonsai", "Matthaei botanical gardens"]}, {"Title": "Nichols Arboretum Peony Garden Bloom Season", "Desc": "The largest collection of heirloom peonies in North America comes alive in spring with as many as 10,000 blooms at peak. Bloom time varies with weather. Visit our dedicated peony website for bloom updates as the season progresses, beginning mid-May: peony.mbgna.umich.edu.", "Loc": "Nichols Arboretum, 1610 Washington Hts., Ann Arbor, MI 48109", "Time": "2019-05-22 10:00", "Cost": " ", "Type": "Other", "Tags": ["Nichols arboretum peony garden", "Peony", "Peony garden"]}, {"Title": "The Cosmic Recipe: Setting the Periodic Table", "Desc": "New planetarium shows and live Star Talks will take visitors beyond space to explore the oceans' reefs, Earth’s geology, weather, and more, all with surround sound and in new, comfortable seats! The Dome has comfortable seating for 57 visitors and space for up to 9 wheelchairs, easy-access seats, and a limited number of hearing assistance devices. Tickets $8. Available one hour before show in the Museum Store.", "Loc": "Biological Sciences Building - Planetarium", "Time": "2019-05-11 10:30", "Cost": "Tickets $8", "Type": "Presentation", "Tags": ["Astronomy", "Museum", "Natural sciences"]}, {"Title": "Science Forum Demo: Fantastic Fluids", "Desc": "Join us in the Science Forum for 15-20 minute engaging science demonstrations that will help you see the world around you in a whole new way. Demonstrations are appropriate for visitors ages 5 and above.", "Loc": "Biological Sciences Building - Science Forum", "Time": "2019-05-04 11:00", "Cost": " ", "Type": "Lecture / Discussion", "Tags": ["Biology", "Children", "Discussion", "Family", "Free", "Museum", "Science"]}, {"Title": "Paleo Prep Lab Chat", "Desc": "Stop by and chat with an educator in front of the Paleo Prep Lab near the mastodons and learn about the tools and skills needed to prepare and cast fossils for research and display.", "Loc": "May 2019", "Time": "2019-05-01 15:00", "Cost": " ", "Type": "Class / Instruction", "Tags": ["Children", "Family", "Free", "Museum", "Natural sciences", "Science"]}, {"Title": "The Sky Tonight", "Desc": "New planetarium shows and live Star Talks will take visitors beyond space to explore the oceans' reefs, Earth’s geology, weather, and more, all with surround sound and in new, comfortable seats! The Dome has comfortable seating for 57 visitors and space for up to 9 wheelchairs, easy-access seats, and a limited number of hearing assistance devices. Tickets $8. Available one hour before show in the Museum Store.", "Loc": "Biological Sciences Building - Planetarium", "Time": "2019-05-09 17:30", "Cost": "Tickets $8.", "Type": "Presentation", "Tags": ["Astronomy", "Museum", "Natural sciences"]}, {"Title": "Abstraction, Color, and Politics in the Early 1970s", "Desc": "Can abstract art be about politics? In the early 1970s, that question was hotly debated as artists, critics, and the public grappled with the relationship between art, politics, race, and feminism. Many of those debates centered on bringing to light the roles that gender and race played in how “great modern art” was defined and assessed, and on employing art to advance civil rights. Within this discourse, abstraction had an especially fraught role. To many, the decision by women artists and artists of color  to make abstract art seemed to represent a retreat from politics and protest: an abnegation of a commitment to civil rights and feminism. \"Abstraction, Color, and Politics in the Early 1970s\" presents large-scale work by four leading American artists—Helen Frankenthaler, Sam Gilliam, Al Loving, and Louise Nevelson—who chose abstraction as a means of expression within the intense political climate of the early 1970s.", "Loc": "Museum of Art", "Time": "2018-09-22 11:00", "Cost": " ", "Type": "Exhibition", "Tags": ["Art", "Culture", "Exhibition", "Museum", "Umma", "Visual arts"]}, {"Title": "Abstraction, Color, and Politics in the Early 1970s", "Desc": "Can abstract art be about politics? In the early 1970s, that question was hotly debated as artists, critics, and the public grappled with the relationship between art, politics, race, and feminism. Many of those debates centered on bringing to light the roles that gender and race played in how “great modern art” was defined and assessed, and on employing art to advance civil rights. Within this discourse, abstraction had an especially fraught role. To many, the decision by women artists and artists of color  to make abstract art seemed to represent a retreat from politics and protest: an abnegation of a commitment to civil rights and feminism. Abstraction, Color, and Politics in the Early 1970s presents large-scale work by four leading American artists—Helen Frankenthaler, Sam Gilliam, Al Loving, and Louise Nevelson—who chose abstraction as a means of expression within the intense political climate of the early 1970s.", "Loc": "Museum of Art - A. Alfred Taubman Gallery II", "Time": "2019-05-10 11:00", "Cost": " ", "Type": "Exhibition", "Tags": ["Art", "Exhibition", "Museum", "Politics", "Umma"]}, {"Title": "Abstraction, Color, and Politics:  The 1960s and 1970s", "Desc": "In the midst of the political and cultural upheavals of the 60s and 70s, artists, critics, and the public grappled with the relationship between art, politics, race, and feminism. During these decades, the notion that abstraction was a purely formal and American art form, concerned only with timeless themes disconnected from the present, was met with increased skepticism. Women artists and artists of color began to actively and assertively explore abstraction’s possibilities. The artworks in Abstraction, Color, and Politics: The 1960s and 1970s demonstrate both radical and disarming changes in how artists worked and what they thought their art was about. Their new formal and intellectual strategies—seen here across large-scale and miniature work—dramatically transformed the practice of abstraction in the 1960s and 1970s in a politically shifting American landscape.", "Loc": "Museum of Art - A. Alfred Taubman Gallery II", "Time": "2019-06-08 11:00", "Cost": " ", "Type": "Exhibition", "Tags": ["Art", "Exhibition", "Museum", "Politics", "Umma"]}, {"Title": "Bauhaus Architectural Exhibition TEST!", "Desc": "Bauhaus Architectural Exhibition TEST", "Loc": "Museum of Art - Albertine Monroe-Brown Study-Storage Gallery", "Time": "2019-05-22 11:00", "Cost": " ", "Type": "Exhibition", "Tags": ["Art", "Exhibition", "Museum", "Umma"]}, {"Title": "Collection Ensemble", "Desc": "FORTY-ONE ARTISTS, FORTY-ONE WORKS OF ART, PUT IN DIALOG FOR YOU TO DISCOVER", "Loc": "Museum of Art - Museum Apse", "Time": "2019-04-05 11:00", "Cost": " ", "Type": "Exhibition", "Tags": ["Africa", "Alumni", "Art", "European", "Exhibition", "Free", "Media", "Museum", "Music", "Umma"]}, {"Title": "Jason DeMarte: Garden of Artificial Delights", "Desc": "Jason DeMarte: Garden of Artificial Delights presents an enigmatic world filled with unexpected and unsettling sensory temptations. In this immersive installation of photographs and wallpaper, Michigan-based photographer Jason DeMarte weaves together detailed images of fauna (birds, caterpillars, and moths) and flora (local plants and flowers). Each scene is set against ominous cloudy skies, which rain melted ice cream, whipped topping, candies, and glossy paint. Overburdened with decorations, the flowers and plants begin to decay, leaving the birds and insects unable to survive for long in this overly sweet environment. DeMarte’s illusionistic landscapes recall the long tradition of still life painting in Europe and America, and a rich history of fantasy environments represented in literature and film—from Alice’s Wonderland to Willy Wonka’s chocolate factory. Yet, his images decidedly foreground the complicated visual circumstances of our contemporary moment and provoke us to consider this imagined and oversaturated world as analogous to our own.", "Loc": "Museum of Art - ArtGym", "Time": "2019-06-08 11:00", "Cost": " ", "Type": "Exhibition", "Tags": ["Art", "Environment", "Exhibition", "Film", "History", "Literature", "Museum", "Umma"]}, {"Title": "New at UMMA: Oshima Tsumugi Kimono", "Desc": "Fashioned in the Amami islands of Japan, Oshima Tsumugi silk has long been admired for its understated beauty, incredible softness, and comfortable year-round lightness. The rich fabric is created through a remarkable and  laborious process: from pattern design and cotton-thread binding, to over 100 rounds of plant and mud dyeing and weaving. This series of steps may take up to one year. Despite the high production values and complexities, Oshima Tsumugi kimono can be worn only for non-ceremonial occasions, since woven fabric is considered to be a less elevated technique than paint-dyed fabric.", "Loc": "Museum of Art - The Connector", "Time": "2019-04-20 11:00", "Cost": " ", "Type": "Exhibition", "Tags": ["Art", "Exhibition", "Museum", "Umma"]}, {"Title": 